tutorials/case_char_1/0.orig/Us
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Us;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);


boundaryField
{
    wall
    {
        type zeroGradient;
    }
    inlet
    {
        type zeroGradient;
    }
    outlet
    {
        type zeroGradient;
    }
}
