tutorials/case_char_1/constant/reactions
species
(
    targas
    gas
    N2
    H2O
);

reactions
(
);
