tutorials/case_char_1/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


defaultFieldValues
(
);

regions
(
    boxToCell
    {
        box (-0.005 -0.005 -0.01) (0.005 0.005 0.01);
        fieldValues
        (
            volScalarFieldValue porosityF 0.4
            volScalarFieldValue porosityF0 0.4
            volScalarFieldValue T 305
        );
    }
);

